app/views/jobs/_form.html.erb

    <%= form.label :customer %>
    <%= form.collection_select :customer_id, Customer.all, :id, :name, {:prompt => '-- Select a Customer --'} %>
---
SELECT "customers".* FROM "customers"

    <%= form.label :designer %>
    <%= form.collection_select :designer_id, Designer.all, :id, :name, {:prompt => '-- Select a Designer --'} %>
---
SELECT "designers".* FROM "designers"