app/views/jobs/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."job_id" = $1  [["job_id", 71]]
---
	<ul>
		<% @job.tasks.each do |task| %>