app/controllers/customers_controller.rb

  def destroy
    @customer.destroy
---
DELETE FROM "customers" WHERE "customers"."id" = $1  [["id", 3]]

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]