app/controllers/designers_controller.rb

  def index
    @designers = Designer.all
---
SELECT "designers".* FROM "designers"

  def create
    @designer = Designer.new(designer_params)

    respond_to do |format|
      if @designer.save
---
INSERT INTO "designers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "bud holloway"], ["created_at", "2019-02-16 06:10:33.280383"], ["updated_at", "2019-02-16 06:10:33.280383"]]

  def update
    respond_to do |format|
      if @designer.update(designer_params)
---
UPDATE "designers" SET "name" = $1, "updated_at" = $2 WHERE "designers"."id" = $3  [["name", "Eunice Escamillas"], ["updated_at", "2019-02-16 21:55:59.195108"], ["id", 1]]

    def set_designer
      @designer = Designer.find(params[:id])
---
SELECT  "designers".* FROM "designers" WHERE "designers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]