app/controllers/jobs_controller.rb

SELECT  "designers".* FROM "designers" WHERE "designers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def index
    # we aren't building an API, so no need to have users/4/jobs work at all!
    # if admin == true @jobs - Job.all
    # else
    #@user = current_user
    #@jobs = @user.jobs
    #@jobs = Job.all


    if params[:designer_id]
      @jobs = Designer.find(params[:designer_id]).jobs
      #@state = State.find(params[:state_id])
      #@cities = State.find(params[:state_id]).citys
    elsif params[:customer_id]
      @jobs = Customer.find(params[:customer_id]).jobs
      #@city = City.find(params[:city_id])
    elsif params[:user_id]
      @jobs = User.find(params[:user_id]).jobs