app/controllers/notes_controller.rb

  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("body", "noteable_type", "noteable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Testing notes "], ["noteable_type", "Job"], ["noteable_id", 83], ["created_at", "2019-02-22 07:13:54.728370"], ["updated_at", "2019-02-22 07:13:54.728370"]]

  def set_note
    @note = Note.find(params[:id])
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]